{"config": [{"config": {"batch_input_shape": [null, 1, 1], "units": 128, "name": "lstm_3", "recurrent_regularizer": null, "implementation": 1, "recurrent_constraint": null, "unroll": false, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "stateful": false, "bias_constraint": null, "return_sequences": true, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"batch_input_shape": [null, 1, 1], "units": 64, "name": "lstm_4", "recurrent_regularizer": null, "implementation": 1, "recurrent_constraint": null, "unroll": false, "unit_forget_bias": true, "activity_regularizer": null, "dropout": 0.0, "activation": "tanh", "kernel_regularizer": null, "bias_regularizer": null, "return_state": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "recurrent_dropout": 0.0, "stateful": false, "bias_constraint": null, "return_sequences": false, "use_bias": true, "kernel_constraint": null, "dtype": "float32", "go_backwards": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_activation": "hard_sigmoid"}, "class_name": "LSTM"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 16, "name": "dense_3", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "class_name": "RandomUniform"}, "units": 1, "name": "dense_4", "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.6"}