{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "LSTM", "config": {"kernel_regularizer": null, "return_sequences": true, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "return_state": false, "batch_input_shape": [null, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "implementation": 1, "units": 128, "go_backwards": false, "name": "lstm_1", "dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null}}, {"class_name": "LSTM", "config": {"kernel_regularizer": null, "return_sequences": false, "stateful": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "recurrent_dropout": 0.0, "activation": "tanh", "return_state": false, "batch_input_shape": [null, 1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_regularizer": null, "use_bias": true, "unit_forget_bias": true, "dtype": "float32", "recurrent_activation": "hard_sigmoid", "activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "trainable": true, "implementation": 1, "units": 64, "go_backwards": false, "name": "lstm_2", "dropout": 0.0, "unroll": false, "bias_constraint": null, "kernel_constraint": null, "recurrent_constraint": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 16, "activation": "relu", "name": "dense_1", "bias_constraint": null, "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "activity_regularizer": null, "kernel_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "units": 1, "activation": "linear", "name": "dense_2", "bias_constraint": null, "use_bias": true, "bias_regularizer": null}}]}